#+title: Org-mode的一些使用方式
# 这是一行注释
* 官方给出的demo
[[file://Users/yaoxiaohui/Documents/note/YXHNote/emacs/org-mode-demo.org][官方Org格式Demo]]

* 介绍
** 打开org-mode
- M-x org-mode
- M-x customize-themes 设置颜色
** 标题说明
1. 用*号来表示标题，一二三级标题对应* ** ***
2. TAB键可以折叠标题
3. 项目号用'-','+','*'（前面需要加空格）,'1.','1)'表示
4. Shift+方向键可以切换项目号类型
5. 最多10个标题

** 注脚
1. 注脚有两种实现方式 [1] 或者 [fn:注释名字]
2. C-c C-c可以实现注脚跳转

** 表格
*** 简单表格
| 1 | one   |
| 2 | two   |
| 3 | three |
+ 简单说就是输入“|第一列|第二列|”等等，然后按“TAB”会帮你自动对齐
+ Tab键可以在表格中移动，S+Tab反向移动（S是shift键）
*** 限制列的字数，注意第一行,第二行文字为test，如果移动鼠标上去会显示
|   | <3> |
| 1 | test |
|---+-----|

*** "|-"可以加一个分隔行，如上
*** 表格可以增加计算功能,最后一行表示用前两列计算勾股定理斜边值。“C-u C-c C-c”可以强制计算
| a | b |           |
|---+---+-----------|
| 3 | 4 |        5. |
| 6 | 8 |       10. |
| 1 | 2 | 2.2360680 |
#+TBLFM: $3=($1^2+$2^2)^0.5

*** 增加链接
1. 链接到当前文件内容[[表格][跳转到表格]],  格式为[[][]] 前一个括号内填写链接的字符串key，后一个括号内填写描述
2. 链接到外部文件 [[file://Users/yaoxiaohui/Documents/note/YXHNote/emacs/link_file.text]] 格式为[[file:目录]] 
3. C-c C-o或者点击鼠标左键，跳转链接
   
* 操作命令
** 光标移动
- C-c C-n 移动到下一个标题
- C-c C-p 移动到上一个标题
- C-c C-f 移动到和当前标题同等级的下一个标题
- C-c C-b 移动到和当前标题同等级的上一个标题
- C-c C-u 向上移动到更高一层的标题
- C-c C-c 注脚跳转（也可以重新绘制表格隐藏内容）
- C-c C-o 超链接跳转
- C-c C-e a 导出为文本文件。
- C-c C-e h 导出为 HTML 文件。
** 刷新命令
- C-u C-c C-c 强制计算表格值
- C-c C-t 或者S+-> S+<- 改变任务状态
* 功能
** 关于任务管理，可以参考http://www.cnblogs.com/holbrook/archive/2012/04/14/2447754.html
以及http://blog.csdn.net/dc_726/article/details/8623879

* 任务管理
** 任务状态
*** 内置好的任务状态： TODO和DONE 其他状态需要用户自定义
*** 自定义任务状态规则
    + 用关键词"#+SEQ_TODO:"起头，定义一组状态
    + 状态之间用空格分隔
    + 可以在状态后用（）添加状态选项，选项类型为：
      - 字符：该状态的快捷键
      - !：切换到该状态时会自动增加时间戳
      - @：切换到该状态时要求输入文字说明
      - 如果同时设定@和!，使用格式@/!
    + 用|分隔未完成和已完成状态，未完成状态在查询代办事项时会列出
*** 自定义任务状态Demo (C-c C-c生效)
#+SEQ_TODO: REPORT(r!) BUG(b) KNOWNCAUSE(k) | FIXED(f@)

*** 设置任务优先级 S+上下方向键

* 这个任务有3步 (可以用C-c C-c改变子任务状态, M-S-RET增加一个子项目)
- [X] step1 [2/2]
  - [X] step1.1
  - [X] step1.2
- [ ] step2 [0/1]
  - [ ] step.2.1
- [-] step3 [0/0]


* 注释
[1] Come On！
[fn:注释名字] Go!

